# ベクトルの生成と置き換え
1:10                            # => 1  2  3  4  5  6  7  8  9 10
seq(1, 10)                      # => 1  2  3  4  5  6  7  8  9 10
seq(1, 10, 2)                   # => 1 3 5 7 9
seq(from=1, to=10, by=2)        # => 1 3 5 7 9
0:4*2+1                         # => 1 3 5 7 9
seq(from=1, length=5, by=2)     # => 1 3 5 7 9
rep(1:3, times=2)               # => 1 2 3 1 2 3
paste(c("X","Y"), 1:4, sep="")  # => "X1" "Y2" "X3" "Y4"
paste(c("X","Y"), 1:4, sep="", collapse="")  # => "X1Y2X3Y4"

v <- 1:5
v[2] <- "a"                     # "1" "a" "3" "4" "5"
v
